# Вывести на экран числа от -N до N

list = [-5, -2, 17, 23, -31, -33]

print(list)