# Вывести на экран числа от -N до N

list = [-2, -1, 0, 1, 2, 3]

print(list)