# В большой текстовой строке подсчитать количество встречаемых 
# слов и вернуть 10 самых частых. 
# Не учитывать знаки препинания и регистр символов. 
# За основу возьмите любую статью из 
# википедии или из документации к языку. 


TEXT = """Python - Высокоуровневый язык программирования общего назначения с динамической строгой типизацией
 и автоматическим управлением памятью, ориентированный на повышение производительности разработчика,
  читаемости кода и его качества, а также на обеспечение переносимости написанных на нём программ. 
  Язык является полностью объектно-ориентированным в том плане, что всё является объектами. 
  Необычной особенностью языка является выделение блоков кода пробельными отступами. 
  Синтаксис ядра языка минималистичен, за счёт чего на практике редко возникает необходимость обращаться к документации. 
  Сам же язык известен как интерпретируемый и используется в том числе для написания скриптов"""

COUNT = 10

words = TEXT.split()
qty_words = {}

for word in words:
    if word.isalpha():
        _word = word.lower()
        qty_words[_word] = qty_words.setdefault(_word, 0) + 1

result = sorted(qty_words, key=qty_words.get, reverse=True)

print(f'10 самых частых слов: {result[:COUNT]}')
