a = int(input("введите сторону треугольника a: "))
b = int(input("введите сторону треугольника b: "))
c = int(input("введите сторону треугольника c: "))

if a + b > c:
    if a + c > b:
        if b + c > a:
            print("Такой треугольник существует")
else:
            print("Такого треугольника не существует!!")    


if a == b:
   if b == c:
        if c == a:
            print("Треугольник равносторонний")
   
if a != b:
    if b != c:
        if c != a:
            print("Треугольник разносторонний")

if a == b:
    if b != c:
        print("Треугольник равнобедренный")



    
   


